In [1]:
import pandas as pd

In [2]:
pd.DataFrame?

In [85]:
friend_dict_list = [
    {
        "name":"John",
        "age":25,
        "job":"student"
    },
    {
        "name":"Nate",
        "age":30,
        "job":"teacher"
    },
    {
        "name":"Jenny",
        "age":30,
        "job":"developer"
    },
]
friend_dict_list

[{'name': 'John', 'age': 25, 'job': 'student'},
 {'name': 'Nate', 'age': 30, 'job': 'teacher'},
 {'name': 'Jenny', 'age': 30, 'job': 'developer'}]

In [86]:
friend_df = pd.DataFrame(friend_dict_list)
friend_df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [9]:
dict = {"국어":[70, 80, 90], "영어":[45, 55, 65], "수학":[75, 85, 95]}
student_df = pd.DataFrame(dict)
student_df

   국어  영어  수학
0  70  45  75
1  80  55  85
2  90  65  95

In [7]:
friend_df2 = pd.DataFrame(friend_dict_list, index=["f1", "f2", "f3"])
friend_df2

     name  age        job
f1   John   25    student
f2   Nate   30    teacher
f3  Jenny   30  developer

In [13]:
student_df2 = pd.DataFrame(dict, index=["1월", "2월", "3월"])
student_df2

    국어  영어  수학
1월  70  45  75
2월  80  55  85
3월  90  65  95

In [12]:
list1 = [[1, 2, 3, 4, 5], [6, 7, 8, 9, 10]]

two_df = pd.DataFrame(list1, index=["내용1", "내용2"], columns=["c1", "c2", "c3", "c4", "c5"])
two_df

     c1  c2  c3  c4  c5
내용1   1   2   3   4   5
내용2   6   7   8   9  10

In [17]:
sample1_df = pd.read_csv("../data/sample1.csv", encoding="cp949")
sample1_df

   번호   이름                 가입일시  나이
0   1  김정수  2017-01-19 11:30:00  25
1   2  박민구  2017-02-07 10:22:00  35
2   3  정순미  2017-01-22 09:10:00  33
3   4  김정현  2017-02-22 14:09:00  45
4   5  홍미진  2017-04-01 18:00:00  17
5   6  김순철  2017-05-14 22:33:07  22
6   7  이동철  2017-03-01 23:44:45  27
7   8  박지숙  2017-01-11 06:04:18  30
8   9  김은미  2017-02-08 07:44:33  51
9  10  장혁철  2017-12-01 13:01:11  16

In [19]:
sample2_df = pd.read_csv("../data/sample2.csv", delimiter="|", encoding="cp949")
sample2_df

   번호   이름                 가입일시  나이
0   1  김정수  2017-01-19 11:30:00  25
1   2  박민구  2017-02-07 10:22:00  35
2   3  정순미  2017-01-22 09:10:00  33
3   4  김정현  2017-02-22 14:09:00  45
4   5  홍미진  2017-04-01 18:00:00  17
5   6  김순철  2017-05-14 22:33:07  22
6   7  이동철  2017-03-01 23:44:45  27
7   8  박지숙  2017-01-11 06:04:18  30
8   9  김은미  2017-02-08 07:44:33  51
9  10  장혁철  2017-12-01 13:01:11  16

In [20]:
sample2_df = pd.read_csv("../data/sample2.csv", index_col=0, delimiter="|", encoding="cp949")
sample2_df

     이름                 가입일시  나이
번호
1   김정수  2017-01-19 11:30:00  25
2   박민구  2017-02-07 10:22:00  35
3   정순미  2017-01-22 09:10:00  33
4   김정현  2017-02-22 14:09:00  45
5   홍미진  2017-04-01 18:00:00  17
6   김순철  2017-05-14 22:33:07  22
7   이동철  2017-03-01 23:44:45  27
8   박지숙  2017-01-11 06:04:18  30
9   김은미  2017-02-08 07:44:33  51
10  장혁철  2017-12-01 13:01:11  16

In [21]:
sample_df = pd.read_excel("../data/sample.xlsx")
sample_df

   Sap Co.        대리점 영업사원       전월       금월  TEAM  총 판매수량
0   KI1316    경기수원대리점  이기정  1720000  2952000     1     123
1   KI1451    충청홍성대리점  정미진  4080000  2706000     2     220
2   KI1534    경기화성대리점  경인선   600000  2214000     1     320
3   KI1636    강원속초대리점  이동권  3720000  2870000     3     110
4   KI1735    경기안양대리점  강준석  4800000  2296000     1     134
5   KI1875   제주제주시대리점  민경수  3420000  2346000     4     210
6   KI1917    경기광주대리점  김진혜  1292000  1518000     1     110
7   KI2032    경기평택대리점  고유정  2736000  2139000     2      90
8   KI2153   경기의정부대리점  김은향  1368000  2484000     1     183
9   KI2214    경기성남대리점  이준수  1976000  1518000     3      73
10  KI2313  제주서귀포시대리점  온지수   152000   945000     1      52
11  KI2433    경기계양대리점  이희영  1833000  1404000     1     110
12  KI2512    경기평촌대리점  강백호  4320000  2312000     3     240
13  KI2671  제주서귀포시대리점  주은명  4040000  4760000     4      50
14  KI2776   경기남양주대리점  김수진  8160000  4352000     2     354
15  KI2870   경기구리시대리점  박진형  6000000  3400000     2     143
16  KI2910    강원춘천대리점  김은향  4800000  4896000     1     176
17  KI3030    강원영동대리점  전수창  4560000  3128000     2      98
18  KI3131    경기하남대리점  김민정  2750000  7268000     3     293
19  KI3252    강원포천대리점  서가은  2420000  4740000     4     240

### 조회

In [23]:
friend_df[0:1] # friend_df[0] 에러남

   name  age      job
0  John   25  student

In [24]:
friend_df[1:3]

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [25]:
friend_df.name # 헤더명이 한글인 경우 사용 지양

0     John
1     Nate
2    Jenny
Name: name, dtype: object

In [26]:
friend_df["name"] # 한글인 경우 접근 추천

0     John
1     Nate
2    Jenny
Name: name, dtype: object

In [27]:
friend_df["age"]

0    25
1    30
2    30
Name: age, dtype: int64

#### loc와 iloc 사용
#### loc : 행, 열 이름, 인덱스 사용해서 조회

In [28]:
friend_df.loc?

In [29]:
friend_df.loc[0]

name       John
age          25
job     student
Name: 0, dtype: object

In [30]:
friend_df.loc[0:1]

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [33]:
friend_df.loc[[0,2]]

    name  age        job
0   John   25    student
2  Jenny   30  developer

In [35]:
friend_df.loc[[0, 2], ["name", "job"]]

    name        job
0   John    student
2  Jenny  developer

#### iloc - index location(행, 열 모두 index로만 접근)

In [37]:
friend_df.iloc[0]

name       John
age          25
job     student
Name: 0, dtype: object

In [38]:
friend_df.iloc[1, 0]

'Nate'

In [39]:
friend_df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [40]:
friend_df.iloc[[0, 2]]

    name  age        job
0   John   25    student
2  Jenny   30  developer

In [41]:
friend_df.iloc[[0, 2], ["name", "job"]]

IndexError: .iloc requires numeric indexers, got ['name' 'job']

In [42]:
friend_df.iloc[[0, 2], [0, 1]]

    name  age
0   John   25
2  Jenny   30

In [43]:
student_df

   국어  영어  수학
0  70  45  75
1  80  55  85
2  90  65  95

In [44]:
student_df[2:3]

   국어  영어  수학
2  90  65  95

In [45]:
student_df.loc[2]

국어    90
영어    65
수학    95
Name: 2, dtype: int64

In [46]:
student_df.loc[2, "수학"]

95

In [47]:
student_df.iloc[2, 2]

95

In [48]:
student_df["국어"] # student_df.국어

0    70
1    80
2    90
Name: 국어, dtype: int64

In [49]:
two_df

     c1  c2  c3  c4  c5
내용1   1   2   3   4   5
내용2   6   7   8   9  10

In [50]:
two_df.loc["내용1"]

c1    1
c2    2
c3    3
c4    4
c5    5
Name: 내용1, dtype: int64

In [51]:
two_df["c2"]

내용1    2
내용2    7
Name: c2, dtype: int64

In [52]:
two_df.c2

내용1    2
내용2    7
Name: c2, dtype: int64

In [53]:
two_df.iloc[0,2]

3

#### column condition
나이가 25살 이상인 학생만 조회

In [54]:
friend_df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [56]:
friend_df.age > 25 # friend_df["age"] > 25

0    False
1     True
2     True
Name: age, dtype: bool

In [57]:
friend_df[friend_df.age > 25]

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [58]:
# 25보다 나이가 많고, 이름이 Nate인 사람 조회
friend_df[friend_df.age > 25 & (friend_df.name == 'Nate')]

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [59]:
friend_df.query("age > 25")

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [60]:
friend_df.query("age > 25" and "name=='Nate'")

   name  age      job
1  Nate   30  teacher

In [62]:
# 이름이 Jenny 조회
friend_df.query("name == 'Jenny'")

    name  age        job
2  Jenny   30  developer

In [64]:
friend_df[friend_df.name == 'Jenny']

    name  age        job
2  Jenny   30  developer

In [63]:
friend_df[friend_df['name'] == 'Jenny']

    name  age        job
2  Jenny   30  developer

In [65]:
student_df

   국어  영어  수학
0  70  45  75
1  80  55  85
2  90  65  95

In [68]:
# 국어 점수가 75 이상인 행만 조회
student_df[student_df["국어"] >= 75]

   국어  영어  수학
1  80  55  85
2  90  65  95

In [69]:
student_df[student_df.국어 >= 75]

   국어  영어  수학
1  80  55  85
2  90  65  95

In [70]:
student_df.query("국어 >= 75")

   국어  영어  수학
1  80  55  85
2  90  65  95

In [71]:
sample_df.head()

  Sap Co.      대리점 영업사원       전월       금월  TEAM  총 판매수량
0  KI1316  경기수원대리점  이기정  1720000  2952000     1     123
1  KI1451  충청홍성대리점  정미진  4080000  2706000     2     220
2  KI1534  경기화성대리점  경인선   600000  2214000     1     320
3  KI1636  강원속초대리점  이동권  3720000  2870000     3     110
4  KI1735  경기안양대리점  강준석  4800000  2296000     1     134

In [76]:
# 총 판매수량 250보다 큰 대리점 조회
sample_df[sample_df["총 판매수량"] > 250]

   Sap Co.       대리점 영업사원       전월       금월  TEAM  총 판매수량
2   KI1534   경기화성대리점  경인선   600000  2214000     1     320
14  KI2776  경기남양주대리점  김수진  8160000  4352000     2     354
18  KI3131   경기하남대리점  김민정  2750000  7268000     3     293

In [80]:
# 2번, 3번 대리점 조회
sample_df.iloc[2:4]

  Sap Co.      대리점 영업사원       전월       금월  TEAM  총 판매수량
2  KI1534  경기화성대리점  경인선   600000  2214000     1     320
3  KI1636  강원속초대리점  이동권  3720000  2870000     3     110

In [81]:
# 금월 컬럼만 조회
sample_df["금월"]

0     2952000
1     2706000
2     2214000
3     2870000
4     2296000
5     2346000
6     1518000
7     2139000
8     2484000
9     1518000
10     945000
11    1404000
12    2312000
13    4760000
14    4352000
15    3400000
16    4896000
17    3128000
18    7268000
19    4740000
Name: 금월, dtype: int64

In [83]:
# 전체 행 조회(대리점, 영업사원 컬럼 열만 조회)
sample_df[["대리점", "영업사원", "금월"]]

          대리점 영업사원       금월
0     경기수원대리점  이기정  2952000
1     충청홍성대리점  정미진  2706000
2     경기화성대리점  경인선  2214000
3     강원속초대리점  이동권  2870000
4     경기안양대리점  강준석  2296000
5    제주제주시대리점  민경수  2346000
6     경기광주대리점  김진혜  1518000
7     경기평택대리점  고유정  2139000
8    경기의정부대리점  김은향  2484000
9     경기성남대리점  이준수  1518000
10  제주서귀포시대리점  온지수   945000
11    경기계양대리점  이희영  1404000
12    경기평촌대리점  강백호  2312000
13  제주서귀포시대리점  주은명  4760000
14   경기남양주대리점  김수진  4352000
15   경기구리시대리점  박진형  3400000
16    강원춘천대리점  김은향  4896000
17    강원영동대리점  전수창  3128000
18    경기하남대리점  김민정  7268000
19    강원포천대리점  서가은  4740000

### 삭제
수정과 삭제는 원본에 직접 적용을 하지 않으면 반영 안 됨

In [93]:
friend_df = pd.DataFrame(friend_dict_list)
friend_df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [88]:
friend_df.drop([0, 2])

   name  age      job
1  Nate   30  teacher

In [89]:
friend_df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [90]:
friend_df.drop([0, 2], inplace=True) # friend_df = friend_df.drop([0, 2])

In [91]:
friend_df

   name  age      job
1  Nate   30  teacher

In [ ]:
friend_df = friend_df.drop([0, 2])

In [94]:
friend_df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [96]:
# age 가 25인 행만 남기고 싶을 때
friend_df = friend_df[friend_df.age == 25]
friend_df

   name  age      job
0  John   25  student

In [97]:
friend_df.drop("age", axis=1)

   name      job
0  John  student

In [98]:
friend_df.drop(columns="age")

   name      job
0  John  student

### 수정

In [99]:
friend_df2

     name  age        job
f1   John   25    student
f2   Nate   30    teacher
f3  Jenny   30  developer

In [100]:
friend_df2.columns = ["이름", "나이", "직업"]

In [101]:
friend_df2

       이름  나이         직업
f1   John  25    student
f2   Nate  30    teacher
f3  Jenny  30  developer

In [102]:
friend_df2.index = ["p1", "p2", "p3"]
friend_df2

       이름  나이         직업
p1   John  25    student
p2   Nate  30    teacher
p3  Jenny  30  developer

In [104]:
friend_df2.loc["p2", "이름"] = 'Torres'
friend_df2

        이름  나이         직업
p1    John  25    student
p2  Torres  30    teacher
p3   Jenny  30  developer

In [108]:
# 특정 행 추가
friend_df2.loc["p4"] = ["Mike", 32, "student"]
friend_df2

        이름  나이         직업
p1    John  25    student
p2  Torres  30    teacher
p3   Jenny  30  developer
p4    Mike  32    student

In [109]:
# 특정 열 추가
friend_df2["주소"] = ["서울", "경기", "광주", "부산"]
friend_df2

        이름  나이         직업  주소
p1    John  25    student  서울
p2  Torres  30    teacher  경기
p3   Jenny  30  developer  광주
p4    Mike  32    student  부산

In [110]:
friend_df2.index

Index(['p1', 'p2', 'p3', 'p4'], dtype='object')

In [111]:
friend_df2.columns

Index(['이름', '나이', '직업', '주소'], dtype='object')

In [112]:
friend_df2.values

array([['John', 25, 'student', '서울'],
       ['Torres', 30, 'teacher', '경기'],
       ['Jenny', 30, 'developer', '광주'],
       ['Mike', 32, 'student', '부산']], dtype=object)

## 데이터프레임 => csv or excel 저장

In [113]:
dict_data = {
    "CD" : [1, 2, 3],
    "CI" : [4, 5, 6]
}
df = pd.DataFrame(dict_data)
df

   CD  CI
0   1   4
1   2   5
2   3   6

In [115]:
# index - False 컬렴명에 콤마 들어가는 것 방지
df.to_csv("../data/df1.csv", index=False)

In [116]:
df.to_excel("../data/df1.xlsx")

### 연습문제

In [139]:
# 그림과 같은 데이터 프레임을 생성하시오
data = {
    "홍길동": [88, 75, 95],
    "강감찬:": [82, 62, 85],
    "김종민": [75, 69, 70],
    "임창정": [45, 56, 80]
}
exam_df = pd.DataFrame([[88, 82, 75, 45], [75, 62, 69, 56], [95, 85, 70, 80]], 
                       index=["java", "python", "basic"], columns=["홍길동", "강감찬", "김종민", "임창정"])
exam_df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   80

In [140]:
# 홍길동 학생의 과목별 점수를 조회

exam_df["홍길동"]

java      88
python    75
basic     95
Name: 홍길동, dtype: int64

In [141]:
# python 과목의 점수들을 조회

exam_df.loc["python"]

홍길동    75
강감찬    62
김종민    69
임창정    56
Name: python, dtype: int64

In [142]:
exam_df.iloc[1]

홍길동    75
강감찬    62
김종민    69
임창정    56
Name: python, dtype: int64

In [143]:
# 임창정 학생의 basic 점수를 78로 수정
exam_df.loc["basic", "임창정"] = 78
exam_df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   78

In [144]:
exam_df.iloc[2, 3] = 78

In [145]:
# 각 학생의 sql 점수를 추가하시오.
# sql 점수는 차례대로 70, 85, 86, 92
exam_df.loc["sql"] = [70, 85, 86, 92]
exam_df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   78
sql      70   85   86   92

In [146]:
# basic 점수를 삭제하시오
exam_df.drop("basic", inplace=True)
exam_df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
sql      70   85   86   92

In [148]:
# 그림에 주어진 형태로 데이터프레임 생성
data = {
    "미국" : [2.1, 2.2, 2.3],
    "한국" : [0.4, 0.5, 0.45],
    "중국" : [10, 13, 15]
}

exam_df2 = pd.DataFrame(data)
exam_df2

    미국    한국  중국
0  2.1  0.40  10
1  2.2  0.50  13
2  2.3  0.45  15

In [149]:
# 인덱스만 모두 조회하기
exam_df2.index

RangeIndex(start=0, stop=3, step=1)

In [150]:
# 컬렴명만 모두 조회하기
exam_df2.columns

Index(['미국', '한국', '중국'], dtype='object')

In [151]:
# 전체 값들만 조회
exam_df2.values

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.5 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

In [154]:
# 미국 컬럼만 조회
exam_df2["미국"]

0    2.1
1    2.2
2    2.3
Name: 미국, dtype: float64

In [161]:
# 그림에 주어진 형태로 데이터프레임 생성
data = {
    "년도" : [2019, 2020, 2021],
    "미국" : [2.1, 2.2, 2.3],
    "한국" : [0.4, 0.5, 0.45],
    "중국" : [10, 13, 15]
}

exam_df3 = pd.DataFrame(data)
exam_df3

     년도   미국    한국  중국
0  2019  2.1  0.40  10
1  2020  2.2  0.50  13
2  2021  2.3  0.45  15

In [162]:
exam_df3 = exam_df3.set_index("년도")
exam_df3

       미국    한국  중국
년도
2019  2.1  0.40  10
2020  2.2  0.50  13
2021  2.3  0.45  15

In [163]:
exam_df3 = exam_df3.reset_index("년도")
exam_df3

     년도   미국    한국  중국
0  2019  2.1  0.40  10
1  2020  2.2  0.50  13
2  2021  2.3  0.45  15